<style  type="text/css"> 
cool {
  width: 100px;
  height: 100px;
  background-color: red;
  position: relative;
  -webkit-animation-name: example; /* Safari 4.0 - 8.0 */
  -webkit-animation-duration: 4s; /* Safari 4.0 - 8.0 */
  -webkit-animation-iteration-count: infinite; /* Safari 4.0 - 8.0 */
  animation-name: example;
  animation-duration: 4s;
  animation-iteration-count: infinite;
}

/* Safari 4.0 - 8.0 */
@-webkit-keyframes example {
  0%   {background-color:red; left:0px; top:0px;}
  25%  {background-color:yellow; left:200px; top:0px;}
  50%  {background-color:blue; left:200px; top:200px;}
  75%  {background-color:green; left:0px; top:200px;}
  100% {background-color:red; left:0px; top:0px;}
}

/* Standard syntax */
@keyframes example {
  0%   {background-color:red; left:0px; top:0px;}
  25%  {background-color:yellow; left:200px; top:0px;}
  50%  {background-color:blue; left:200px; top:200px;}
  75%  {background-color:green; left:0px; top:200px;}
  100% {background-color:red; left:0px; top:0px;}
}
</style>

<b><center>
<span style="font-size: 24pt; line-height: 1.2">
COMS W4111: Introduction to Databases<br>
Spring 2023, Sections 002
</span>
</center></b>
<br>
<p>
<i><center>
<span style="font-size: 20pt; line-height: 1.2">
Take Home Midterm<br>
    
</span>
</center></i>

# Overview

## Instructions

__Due Date: Sunday, 2023-MAR-12 at 11:59pm__


__You may not use late days.__


You have one week to complete the take home portion of the midterm. All of the work must be your own, you may not work in groups or teams. You may use outside sources so long as you cite them and provide links. 

Points will be taken off for any answers that are extremely verbose. Try to stay between 2-3 sentences for definitions and 5 sentences for longer questions. 

You may post __privately__ on Ed or attend OH for clairification questions. TAs will not be providing hints.

There is a [post on Ed](https://edstem.org/us/courses/32981/discussion/2716284) that:
- Provides submission instructions.
- Clarifications and corrections on questions.
    
__Students are responsible for reading and monitoring the post.__

## Environment Setup

- __Note:__ You will need to change the MySQL userID and password in some of the cells below to match your configuration.

### Environments

- Different applications and different scenarios use different ways to interaction with databases.


- We use three different connection/interaction models to give students experience with the various options.

### ipython-SQL

In [1]:
%load_ext sql

In [2]:
#
# Set the userid and password for connecting to your instance of SQL.
#
mysql_user = "root"
mysql_password = "dbuserdbuser"

mysql_url = f"mysql+pymysql://{mysql_user}:{mysql_password}@localhost"
    
print("Your connection URL is", mysql_url)

Your connection URL is mysql+pymysql://root:dbuserdbuser@localhost

In [3]:
#
# Connect. See the ipython-sql documentation for the $variable syntax.
#
%sql $mysql_url

### SQL Alchemy and Pandas

In [4]:
#
# Yes, I know the cool kids import as pd. I am not cool.
#
import pandas

In [5]:
#
# Pandas SQL operations require a SQL Alchemy engine.
#
from sqlalchemy import create_engine

In [6]:
sql_engine = create_engine(mysql_url)

### pymysql

In [7]:
import pymysql

In [8]:
pymysql_con = pymysql.connect(
    user= mysql_user,
    password= mysql_password,
    host= "localhost",
    port= 3306,
    autocommit= True,
    cursorclass= pymysql.cursors.DictCursor)

## Data Loading

### Classic Models

- We will use the [Classic Models](https://www.mysqltutorial.org/mysql-sample-database.aspx) sample database for many of the questions on this exam.


- The directory containing this notebook contains a file ```classic-models-sample.sql```.


- Load the data:
    - Open the file in DataGrip using ```File -> Open``` dialog.
    - Select all of the text/SQL in the file.
    - Click the green arrowhead to run the files contents.
    
    
- Running the following queries will test if the load worked.

In [9]:
%sql use classicmodels;

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [10]:
%sql show tables;

 * mysql+pymysql://root:***@localhost
8 rows affected.

[('customers',),
 ('employees',),
 ('offices',),
 ('orderdetails',),
 ('orders',),
 ('payments',),
 ('productlines',),
 ('products',)]

In [11]:
%sql select count(*) as count from orders join orderdetails using(orderNumber)

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(2996,)]

### Lahman's Baseball Database

- You previously loaded information from [Lahman's Baseball Database.](https://www.seanlahman.com/)


- If you have not done so, the following code will load the data into a new schema ```lahmansdb_midterm```.

In [12]:
%sql create schema lahmansdb_midterm

 * mysql+pymysql://root:***@localhost
(pymysql.err.ProgrammingError) (1007, "Can't create database 'lahmansdb_midterm'; database exists")
[SQL: create schema lahmansdb_midterm]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [13]:
people_df = pandas.read_csv("./People.csv")
people_df.to_sql("people", schema="lahmansdb_midterm", con=sql_engine,index=False, if_exists="replace")

20370

In [14]:
batting_df = pandas.read_csv("./Batting.csv")
batting_df.to_sql("batting", schema="lahmansdb_midterm", con=sql_engine,index=False, if_exists="replace")

110495

In [15]:
pitching_df = pandas.read_csv("./Pitching.csv")
pitching_df.to_sql("pitching", schema="lahmansdb_midterm", con=sql_engine,index=False, if_exists="replace")

49430

- This will test the data loading.

In [16]:
%sql select count(*) as people_count from lahmansdb_midterm.people;

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(20370,)]

In [17]:
%sql select count(*) as batting_count from lahmansdb_midterm.batting;

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(110495,)]

In [18]:
%sql select count(*) as pitching_count from lahmansdb_midterm.pitching;

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(49430,)]

# Written Questions

## W1

_Question_


- Define the concept of _immutable_ column and key.


- Why do some sources recommend that a primary key should be immutable?


- How would to implement immutability for a primary key in a table?

<u>Answer</u>

* 1. Immutable columns are columns in a database that  CANNOT be modified once it is set. Immutable keys are keys that their values CANNOT be modified once they are initially assigned, and these keys may contain one or more columns, which indicates that immutable keys are a combination of immutable columns.

* 2. The primary key should be immutable. This is because, a primary key's purpose is to uniquely identify a tuple, and inherently, the values of primary keys should never change. By ensuring its immutability, issues such as missing corresponding primary key values, which can occur when other tables refer to a tuple with an altered primary key, are avoided.

* 3. It is very often that we set a trigger to make primary keys immutable. Same as that in the lecture, we use the trigger restrict the behaviour of the *update operation*, where we set primary keys unchangeable, otherwise, an error will be displayed.

**Reference: https://en.wikipedia.org/wiki/Talk%3APrimary_key#:~:text=The%20primary%20key%20should%20be,by%20definition%2C%20never%20changes.)**

## W2

_Question_

Views are a powerful concept in relational database management systems. List and briefly explain 3 benefits of/reasons for creating a view.

_Answer_

**Benefits**

* i. Simplification: Views make it easier for naive users to do complicated queries. This is because view convert those complicated queries statements into views so that users without comprehensive knowledge of SQL can access the results of such queries via pre-defined views.

* ii. Privacy: It is very often that we do not want users to get access to the entire logical model (e.g. salary column of a people table can be confidential). A view can prevent users getting access to those information by not including them in the view.

* iii. Safety: Using views may protect application from schema changes. Definitions of views and schema are isolated, therefore, changing schema definition will not change views. Also, views can be set to read-only so that users may not modify the underlying relation of the dataset by using views.

**Reference: Lecture and lecture slides.**

## W3

_Question_

Briefly explain the concepts of _procedural_ language and _declarative_ language. SQL is primarily a declarative language. SQL added procedure language capabilities in functions, procedures and triggers. What is a reason for this addition?

_Answer_

* Procedural language: This requires users to specify what data are needed and how to get the data.

* Declarative language: This requires users to specify what data are needed only. Users do not need to specify how to get those data.

* The reason for the addition is that SQL, as a primarily declarative language, it cannot compute everything (it does not know how to get data). By adding capabilities in functions, procedures and triggers, this allows users to compute complicated things that is not very possible to do with declarative language, which grants users flexibility to pre-define actions in manipulating database.

**Reference: https://www.db-book.com/slides-dir/PDF-dir/ch1.pdf and lecture**

## W4

_Question_ 

The following diagram is a simple representation of the architecture of a Jupyter notebook using MySQL. Is this a two-tier architecture or a three-tier architecture? Explain your answer briefly.

<img src="./jupyter-notebook.png">

_Answer_

* This is a typical *three-tier architecture*.

* This is because it includes i. a user ii. an application client (browser) iii. an application server (notebook server) iv. a database system (MySQL), where a *two-tier architecture* should not include an application server and the application client does not interact with the database system directly.

**Reference: https://www.db-book.com/slides-dir/PDF-dir/ch1.pdf**

## W5

_Question_ 

- Consider a US Social Security Number. An example is "012-34-6789".


- The data _type_ is character string.


- The relational model requires that columns (attributes) are from a _domain._


- Use the Social Security Number example to explain the difference between a type and a domain.

<br><br>

_Answer_

*Type* specifies what kind of data can be stored in an attribute, such as integer, varchar, date, etc.

*Domain* Domains are similar but can have constraints, such as not null, specified on them. Also, it is usually a subset of plausible values of a type.

If we use SSN as example, we know that its type is *character string*, which includes all strings of the desired length if there is a length requirement (the question does not specify this). But in terms of domain, an SSN MUST be of the form *XXX-XX-XXXX* (X can be a digit), which means not all character strings are acceptable for the SSN attribute. This means we have extra constraints on the domain of SSN, it is a subset of character string. Also, we may further set not null on SSN since it is usually regarded as a unique ID.

## W6

_Question_

Briefly explain the differences between:

- Database stored procedure
- Database function
- Database trigger

_Answer_

* Database stored procedure: It can modify data and sometimes return values. It can be called via codes (SQL statements).

* Database function: It CANNOT modify data and always return values. It can be called by users' SQL statements.

* Trigger: It can modify data but it CANNOT return any values. Same as its name, it is invoked by certain actions (update, insert, etc.)

**Reference: https://www.youtube.com/watch?v=VpJyzd5BY3Y**

## W7

_Question_


Briefly explain:

- Natural join
- Equi-join
- Theta join
- Self-join

_Answer_

* Natural join merges two tables based on columns with the same name and data type/domain. They match them and remove any duplication.

* Equi-join merges two tables by matching the same value of a specific column or specific columns specified by the user.

* Theta join merges two tables in a manner that is similar to Equi-join, but it allows not only *same value* conditions, it supports comparison operators (>, <, =, etc.) for one or more columns, which is called a *theta condition*.

* Self-join merges a table with itself. This is useful when we want to find the intrinsic relationship of a table. Say we have a people table with different job titles, and we want to know who is the boss of some people, we may use self-join.

**Reference: https://www.guru99.com/joins-sql-left-right.html#5**

## W8

_Question_

Briefly explain the difference between a _unique (key) constraint_ and a _primary key constraint?_

_Answer_

The major differences are that

* There can be only one primary key in a table, whereas there can be multiple unique keys.

* Despite both must be unique, primary keys must be NOT NULL, whereas unique keys can be NULL

## W9

_Question_

Give two reasons for using an _associative entity_ to implement a relationship instead of using a foreign key.

_Answer_

* It allows many-to-many relationship when two tables have more than one relationship, whereas foreign keys cannot.

* It allows us to include attributes in the associative entity that do not appear in neither table. This grants us the ability to store more information. A foreign key cannot do that because there is no extra table to store any information.

## W10

_Question_

Briefly explain the concepts of:
- Conceptual model
- Logical model
- Physical model

For data modeling.

_Answer_

* Conceptual model: It only contains entity names and relationships. It is a high-level overview of a database system for audience with limited data modelling knowledge such as stakeholders.

* Logical model:  It includes entity names, entity relationships, attributes, primary keys, foreign keys. It is for clarification and more detail relationships between entities of the database.

* Physical model: A physical model has primary keys, foreign keys, tables names, column names, column datatypes. It is for technical implementation purpose. The major audiences are database administrators and database developers. It has all detailed implementation information such as data type.

## W11

_Question_

Briefly explain the concepts of:
- Data manipulation language
- Data definition language

Given an example statement in SQL for DML and for DDL.

_Answer_

Data Manipulation Language (DML): It allows query, insert, delete and update the database. A simple example can be a query:

` SELECT table_name, column_name FROM INFORMATION_SCHEMA.columns LIMIT 20`

Data definition language (DDL): It is notations for defining the database schema and can be used to modify the structure of a database. An example can be creating a table:

`CREATE TABLE instructor ( ID char(5), name varchar(20), dept_name varchar(20), salary numeric(8,2))`

**Reference https://www.db-book.com/slides-dir/PDF-dir/ch1.pdf**

## W12

_Question_

Codd's 4th rule is:

<u>Rule 4 - Dynamic online catalog based on the relational model:</u>

The data base description is represented at the logical level in the same way as ordinary data, so that authorized users can apply the same relational language to its interrogation as they apply to the regular data.

Explain what this means, and use SQL to provide examples.

_Answer_

Codd's 4th rule is: *The structure description of the entire database must be stored in an online catalog, known as data dictionary, which can be accessed by authorized users. Users can use the same query language to access the catalog which they use to access the database itself.* **This is the original definition from the lecture slide.**

**This means that the information about the schema (database description) is also a relation. Users can use queries to see the table information of the database, which is usually called metadata (data about data)**

We provide two examples here:

In [19]:
%%sql
## See tables in the 'classicmodels' schema
USE information_schema;
SELECT table_schema AS schema_name, table_name
FROM tables
WHERE table_schema = 'classicmodels';

 * mysql+pymysql://root:***@localhost
0 rows affected.
8 rows affected.

[('classicmodels', 'customers'),
 ('classicmodels', 'employees'),
 ('classicmodels', 'offices'),
 ('classicmodels', 'orderdetails'),
 ('classicmodels', 'orders'),
 ('classicmodels', 'payments'),
 ('classicmodels', 'productlines'),
 ('classicmodels', 'products')]

In [20]:
%%sql
## See columns in the 'products' table of 'classicmodels' schema
SELECT table_schema, table_name, column_name, column_type, column_key
FROM INFORMATION_SCHEMA.columns
WHERE table_schema = 'classicmodels' AND table_name = 'products'

 * mysql+pymysql://root:***@localhost
9 rows affected.

[('classicmodels', 'products', 'productCode', 'varchar(15)', 'PRI'),
 ('classicmodels', 'products', 'productName', 'varchar(70)', ''),
 ('classicmodels', 'products', 'productLine', 'varchar(50)', 'MUL'),
 ('classicmodels', 'products', 'productScale', 'varchar(10)', ''),
 ('classicmodels', 'products', 'productVendor', 'varchar(50)', ''),
 ('classicmodels', 'products', 'productDescription', 'text', ''),
 ('classicmodels', 'products', 'quantityInStock', 'smallint', ''),
 ('classicmodels', 'products', 'buyPrice', 'decimal(10,2)', ''),
 ('classicmodels', 'products', 'MSRP', 'decimal(10,2)', '')]

## W13

_Question_

The formal definition of a theta join is

\begin{equation}
𝑟 \bowtie_𝜃 𝑠 = 𝜎_𝜃  (𝑟 \times 𝑠)
\end{equation}

Briefly explain the definition and give an example. 

Why is the fact that the relational algebra is closed is important to this definition?

_Answer_

This definition means a theta join can be regarded as a select operation on cartesian product operation. They are equivalent. An example can be as follows

`instructor ⨝ ID = i_id advisor`

<img src="./theta.png">

`σ instructor.ID = advisor.i_id (instructor ⨯ advisor)`

<img src="./product.png">

Why relational algebra is closed is important to the definition? This is because if we apply realtional algebra to some relations or tables, it never returns something that is out of the scope, i.e., it never produce things other than valid relations that can be used as input for next relational algebra operation. Therefore, theta join is equivalently to two consequtive relational algebra operations.

## W14

_Question_

Consider two different statements in the relational algebra or SQL.


Despite being different statements, the statements may be <u>equivalent.</u> Briefly explain what this means.

_Answer_

In question *W13*, we saw that, despite we used two different relational algebra statements, they generated the same results. This means they are equivalent because there is no difference in the final results. Since relational algebra can be easily translate into SQL statements, the arguments remains the same, i.e., two different SQL statements are equivalent as long as they produce the same results.

**Reference: https://medium.com/@uwdb/introducing-cosette-527898504bd6**

## W15

_Question_

Consider the following relation definitions.

\begin{equation}
Customers(ID, last\_name, first\_name)
\end{equation}


\begin{equation}
Accounts(ID, balance, customer\_ID)
\end{equation}


What is problem with using natural join on the two tables?

_Answer_

Natural join use the column with the same name to merge two tables. In this case, it uses the column `ID`. However, they do not refer to the same thing. The `ID` in `Customers` is the `customer_ID` in the `Accounts`. So  natural join will produce a useless table. Furthermore, if the two `ID`s have different type, the natural join will not work at all.

# Entity Relationship Modeling

## ER-1

_Question_

This question tests your ability to "bottom up" model or "reverse engineering" a SQL schema to produce an explanatory ER-diagram.


Use Lucidchart to draw a Crow's Foot notation diagram representing the following SQL.


You can use the simple table names, e.g. ```students``` instead of ```s23_w4111_midterm.students```.


```
drop schema if exists s23_midterm;

create schema s23_midterm;

use s23_midterm;

drop table if exists departments;
create table if not exists departments
(
    dept_code varchar(4)   not null
        primary key,
    dept_name varchar(128) not null
);

drop table if exists instructors;
create table if not exists instructors
(
    UNI        varchar(12)  not null
        primary key,
    last_name  varchar(128) not null,
    first_name varchar(128) not null,
    dept_code  varchar(4)   null,
    constraint instructor_dept
        foreign key (dept_code) references departments (dept_code)
);

drop table if exists students;
create table if not exists students
(
    UNI        varchar(12)  not null
        primary key,
    last_name  varchar(128) null,
    first_name varchar(128) null
);

drop table if exists students_advisors;
create table if not exists students_advisors
(
    student_uni         varchar(12) not null,
    instructor_uni      varchar(12) not null,
    advising_start_date date        not null,
    advising_end_date   date        null,
    primary key (student_uni, instructor_uni, advising_start_date),
    constraint student_advisor_instructor
        foreign key (instructor_uni) references instructors (UNI),
    constraint student_advisors_student
        foreign key (student_uni) references students (UNI)
);


```

_Answer_

- Put your screen capture in the same directory as the midterm.


- Add ```<img src='./myfile.name'>``` in the Markdown cell, using the actual file name.

## Please note that according to the SQL statements above, instructors may have one or zero department since its `dept_code` can be `NULL`. But this does not make any sense. So we assume that this a typo or people always insert data into the `instructors` table with a `dept_code`. If the SQL statements are correct, then the following ER diagram should be modified with instructors having one or zero department.

<img src='./ER1.png'>

## ER-2

_Question_

- This question tests your ability to convert a human language description of a data model into a Crow's Foot ER-Diagram.


- Consider the data model for Classic Models that you loaded.



- ```orders``` has a column ```comments.```

In [21]:
%sql select * from classicmodels.orders limit 10;

 * mysql+pymysql://root:***@localhost
10 rows affected.

[(10100, datetime.date(2003, 1, 6), datetime.date(2003, 1, 13), datetime.date(2003, 1, 10), 'Shipped', None, 363),
 (10101, datetime.date(2003, 1, 9), datetime.date(2003, 1, 18), datetime.date(2003, 1, 11), 'Shipped', 'Check on availability.', 128),
 (10102, datetime.date(2003, 1, 10), datetime.date(2003, 1, 18), datetime.date(2003, 1, 14), 'Shipped', None, 181),
 (10103, datetime.date(2003, 1, 29), datetime.date(2003, 2, 7), datetime.date(2003, 2, 2), 'Shipped', None, 121),
 (10104, datetime.date(2003, 1, 31), datetime.date(2003, 2, 9), datetime.date(2003, 2, 1), 'Shipped', None, 141),
 (10105, datetime.date(2003, 2, 11), datetime.date(2003, 2, 21), datetime.date(2003, 2, 12), 'Shipped', None, 145),
 (10106, datetime.date(2003, 2, 17), datetime.date(2003, 2, 24), datetime.date(2003, 2, 21), 'Shipped', None, 278),
 (10107, datetime.date(2003, 2, 24), datetime.date(2003, 3, 3), datetime.date(2003, 2, 26), 'Shipped', 'Difficult to negotiate with customer. We need more marketing materials', 131),
 (10108, datetime.date(2003, 3, 3), datetime.date(2003, 3, 12), datetime.date(2003, 3, 8), 'Shipped', None, 385),
 (10109, datetime.date(2003, 3, 10), datetime.date(2003, 3, 19), datetime.date(2003, 3, 11), 'Shipped', 'Customer requested that FedEx Ground is used for this shipping', 486)]

- There are several issues with this design:
    - If there are multiple comments or responses to comments, the ```comments``` field becomes multi-valued.
    - The approach does not have information on when the comment was made, who made the comment and whether it is a response or elaboration.
    
    
- You will solve this problem in a simplified version of classic models. In the simplified model, there are three entity types:
    1. ```person``` has the following attributes:
        - ```ID```
        - ```last_name```
        - ```first_name```
    2. ```orders``` has the following attributes:
        - ```order_id```
        - ```order_status```
        - ```order_date```
    3. ```comments``` has the following attributes:
        - ```comment_id``` is a unique ID for all comments.
        - ```parent_comment_id``` is the ```comment_id``` of a comment for which this comment is a response or elaboration.
        - ```comment_timestamp```, when the comment occured.
        - ```commenter_id``` is the ID of the person making the comment.
        - ```order_id``` is the ID of the order for to which this comment applies.
        - ```comment_text```
        
        
- Use Lucidchart to draw a _logical model_ for the described datamodel.


- You may add notes to the diagram to document reasonable assumptions or desgn decisions.

_Answer_

- Put your screen capture in the same directory as the midterm.


- Add ```<img src='./myfile.name'>``` in the Markdown cell, using the actual file name.

<img src='./ER2.png'>

# Relational Algebra

- Use the [RelaX Calculator and the Silberschatz calculator](https://dbis-uibk.github.io/relax/calc/gist/4f7866c17624ca9dfa85ed2482078be8/relax-silberschatz-english.txt/0) with the Silberschatz database for these questions.


- Your answers will have two Markdown cells. The first is the relational statement you used to solve the problem. The second is a screen capture of the query execution and first page of result rows. And example is:

```
π course_id, title,
	instructor_id←ID,
	instructor_name←name
(
	(
		(course ⨝ section) 
		⨝ 
		teaches
	) 
	⨝
	instructor
)
```

<img src="./relational-example.png">

## R1

_Question_

- Consider the relation produced by:

```
π course_id, sec_id, building, room_number, time_slot_id (section)
```

- This contains sections, their time assignments and room assignments independent of the year and semester.


- Two sections in this derived table conflict if they have the same ```building, room_number, time_slot_id```.


- My answer to this question is ... ...

|one.course_id|one.sec_id|one.building|one.room_number|one.time_slot_id|two.course_id|two.sec_id|two.building|two.room_number|two.time_slot_id|
|-------------|----------|------------|---------------|----------------|-------------|----------|------------|---------------|----------------|
|CS-347       |1         |Taylor      |3128           |A               |CS-190       |2         |Taylor      |3128           |A               |
|EE-181       |1         |Taylor      |3128           |C               |CS-319       |2         |Taylor      |3128           |C               |

- Your answer cannot include courses and sections that conflict with themselves, or have two rows that show the same conflict.

_Answer_

`(ρ s1 (π course_id, sec_id, building, room_number, time_slot_id (section)))
⨝ s1.building = s2.building and s1.room_number = s2.room_number and s1.time_slot_id = s2.time_slot_id and s1.course_id ≠ s2.course_id and s1.course_id > s2.course_id
(ρ s2 (π course_id, sec_id, building, room_number, time_slot_id (section)))`

Part 1 of the screenshot (too many columns)

<img src="./R1P1.png">

Part 2 of the screenshot (too many columns)

<img src="./R1P2.png">

## R2

_Question_

- You may use the following operators for this question: ```π, σ, ρ, ←```. (can use JOINs)


- Use the ```instructor, student, advisor``` tables for this question.


- There are some students that do not have advisors. That are some instructors that are not advisors.


- An ```instructor``` can be an advisor for a ```student``` if they are in the same department (```dept_name```).


- Produce a relation of the form

```(instructor_id, instructor_name, instructor_dept_name, student_id, student_name, student_dept_name)```

- That matches instructors that do not advise students and students that do not have advisors and are in the same department.

_Answer_

`no_adv = σ s_id = NULL (student ⟕ student.ID = ad.s_id ρ ad π s_id (advisor))
no_stu = σ i_id = NULL (instructor ⟕ instructor.ID = in.i_id ρ in π i_id (advisor))
π instructor_id ← instructor.ID, instructor_name ← instructor.name, instructor_dept_name ← instructor.dept_name, student_id ← student.ID, student_name ← student.name, student_dept_name ← student.dept_name
(no_adv ⨝ student.dept_name = instructor.dept_name no_stu)
`

<img src="./R2P1.png">

<img src="./R2P2.png">

# SQL

## S1

_Question_

- You have a logical datamodel ER-diagram (see below).


- You need to use DDL to define a schema that realizes the model.


- Logical models are not specific enough for direct implementation. This means that:
    - You will have to assign concrete types to columns, and choose things like ```GENERATED,``` ```DEFAULT,``` etc.
    - You may have to decompose a table into two tables, or extract common attributes from multiple tables into a single, referenced table.
    - Implementing the relationships may require adding columns and foreign keys, associative entities, etc.
    - You may have to make other design and implementation choices. <b>This means that there is no single correct answer.</b>
    

- You should document any reasonable assumptions you make.


| <img src="./s23-midterm-er-to-sql-v2.png"> |
| :---: |
| __ER Diagram__ |

_Answer_

Design Decisions, Notes, etc:

a. `Physician` and `Patient` are two essential tables in this schema. They do not reference other tables.

b. `Physician` and `Patient` are connected via the `Appointment` associative entity. Thus, the primary keys of `Physician` and `Patient` must appear in `Appointment` as foreign keys. Thus, they are added as extra columns in `Appointment`.

c. `Bill` must correspond to exactly ONE `Appointment`. So it must reference `Appointment` via a foreign key, which is an extra column `appt_ID` in `Bill`.

d. `Payment` must correspond to exactly ONE `Bill`. So it must reference `Bill` via a foreign key, which is an extra column `bill_ID` in `Bill`.

e. We know that `Payment` and `Patient` have zero or one `Insurance_Company`, whereas `Insurance_Company` can have zero or many `Payment`s and `Patient`s. So we may implement `Insurance_Company` with only one primary key column, `company_ID`. So we decompose the `Insurance_Company` table. We use two more associative entities, `Associative_Patient_Insurance` and `Associative_Payment_Insurance`, to better implement the schema. They have `patient_ID` and `receipt_ID` as foreign keys to reference the `Patient` and the `Payment` tables, and then we add `company_ID` to both associative entities so that we know which `Insurance_Company` is associative with it. **This design makes sure that if a `Patient` or a `bill` do not have `Insurance_Company`, then they do not appear in the associative entities, with all others being rows in the associative entities.**

_DDL_

- Execute your DDL in the cell below. You may use DataGrip or other tools to help build the schema.


- You can copy and paste the ```SQL CREATE TABLE``` below, but you MUST execute the statements.

In [22]:
%sql drop schema if exists s23_midterm_medical
%sql create schema s23_midterm_medical

 * mysql+pymysql://root:***@localhost
8 rows affected.
 * mysql+pymysql://root:***@localhost
1 rows affected.

[]

In [23]:
%sql USE s23_midterm_medical

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [24]:
%%sql


# Drop before create 
DROP TABLE If EXISTS Physician;
DROP TABLE If EXISTS Patient;
DROP TABLE If EXISTS Appointment;
DROP TABLE If EXISTS Bill;
DROP TABLE If EXISTS Payment;
DROP TABLE If EXISTS insurance_company;

#Create the six main tables

# Physician
CREATE TABLE Physician(
physician_ID varchar(128) NOT NULL,
last_name varchar(128) NOT NULL,
first_name varchar(128) NOT NULL,
physician_type enum('NP', 'MD', 'DO') NOT NULL,
PRIMARY KEY (physician_ID)
);

# Patient
CREATE TABLE Patient(
patient_ID varchar(128) NOT NULL,
last_name varchar(128) NOT NULL,
first_name varchar(128) NOT NULL,
street1 varchar(128) NOT NULL,
city varchar(128) NOT NULL,
state varchar(128) NOT NULL,
postal_code varchar(128) NOT NULL,
PRIMARY KEY (patient_ID)
);

# Appointment
CREATE TABLE Appointment(
appt_ID varchar(128) NOT NULL,
appt_date date NOT NULL,
appt_time time NOT NULL,
appt_duration int NOT NULL,
appt_reason char(3) DEFAULT NULL,
physician_ID varchar(128) NOT NULL,
patient_ID varchar(128) NOT NULL,
PRIMARY KEY (appt_ID),
FOREIGN KEY (physician_ID) REFERENCES Physician(physician_ID),
FOREIGN KEY (patient_ID) REFERENCES Patient(patient_ID),
CONSTRAINT CHECK (0 < appt_duration < 120)
);

# Bill
CREATE TABLE Bill(
bill_ID varchar(128) NOT NULL,
amount_insured float NOT NULL,
amount_not_insured float NOT NULL,
bill_total float GENERATED ALWAYS AS (amount_insured + amount_not_insured) NOT NULL,
bill_date date NOT NULL,
bill_status enum('PAID', 'UNPAID', 'DISPUTED') NOT NULL,
appt_ID varchar(128) NOT NULL,
PRIMARY KEY (bill_ID),
FOREIGN KEY (appt_ID) REFERENCES Appointment(appt_ID),
CONSTRAINT CHECK (bill_total > 0),
CONSTRAINT CHECK (amount_insured > 0),
CONSTRAINT CHECK (amount_not_insured > 0)
);

# Payment
CREATE TABLE Payment(
receipt_ID varchar(128) NOT NULL,
paid_amount float NOT NULL,
paid_date date NOT NULL,
paid_type enum('CHECK', 'CREDITCARD', 'INSURANCE') NOT NULL,
patient_ID varchar(128) NOT NULL,
bill_ID varchar(128) NOT NULL,
FOREIGN KEY (patient_ID) REFERENCES Patient(patient_ID),
FOREIGN KEY (bill_ID) REFERENCES Bill(bill_ID),
PRIMARY KEY (receipt_ID),
CONSTRAINT CHECK (paid_amount > 0)
);

#Insurance_Company
CREATE TABLE Insurance_Company(
company_ID varchar(128) NOT NULL,
PRIMARY KEY (company_ID)
);

 * mysql+pymysql://root:***@localhost
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [25]:
%%sql

# Drop before create 
DROP TABLE If EXISTS Associative_Patient_Insurance;
DROP TABLE If EXISTS Associative_Payment_Insurance;

# Create the two associative tables

# patient & insurance
CREATE TABLE Associative_Patient_Insurance(
patient_ID varchar(128) NOT NULL,
company_ID varchar(128) NOT NULL, 
PRIMARY KEY (patient_ID),
FOREIGN KEY (patient_ID) REFERENCES Patient(patient_ID),
FOREIGN KEY (company_ID) REFERENCES insurance_company(company_ID)
);

# 
CREATE TABLE Associative_Payment_Insurance(
payment_ID varchar(128) NOT NULL,
company_ID varchar(128) NOT NULL, 
PRIMARY KEY (payment_ID),
FOREIGN KEY (payment_ID) REFERENCES Payment(receipt_ID),
FOREIGN KEY (company_ID) REFERENCES insurance_company(company_ID)
);

 * mysql+pymysql://root:***@localhost
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

**We now describe the six main tables and the two relational tables we have created.**

In [26]:
%sql DESCRIBE Physician;

 * mysql+pymysql://root:***@localhost
4 rows affected.

[('physician_ID', 'varchar(128)', 'NO', 'PRI', None, ''),
 ('last_name', 'varchar(128)', 'NO', '', None, ''),
 ('first_name', 'varchar(128)', 'NO', '', None, ''),
 ('physician_type', "enum('NP','MD','DO')", 'NO', '', None, '')]

In [27]:
%sql DESCRIBE Patient;

 * mysql+pymysql://root:***@localhost
7 rows affected.

[('patient_ID', 'varchar(128)', 'NO', 'PRI', None, ''),
 ('last_name', 'varchar(128)', 'NO', '', None, ''),
 ('first_name', 'varchar(128)', 'NO', '', None, ''),
 ('street1', 'varchar(128)', 'NO', '', None, ''),
 ('city', 'varchar(128)', 'NO', '', None, ''),
 ('state', 'varchar(128)', 'NO', '', None, ''),
 ('postal_code', 'varchar(128)', 'NO', '', None, '')]

In [28]:
%sql DESCRIBE Appointment;

 * mysql+pymysql://root:***@localhost
7 rows affected.

[('appt_ID', 'varchar(128)', 'NO', 'PRI', None, ''),
 ('appt_date', 'date', 'NO', '', None, ''),
 ('appt_time', 'time', 'NO', '', None, ''),
 ('appt_duration', 'int', 'NO', '', None, ''),
 ('appt_reason', 'char(3)', 'YES', '', None, ''),
 ('physician_ID', 'varchar(128)', 'NO', 'MUL', None, ''),
 ('patient_ID', 'varchar(128)', 'NO', 'MUL', None, '')]

In [29]:
%sql DESCRIBE Bill;

 * mysql+pymysql://root:***@localhost
7 rows affected.

[('bill_ID', 'varchar(128)', 'NO', 'PRI', None, ''),
 ('amount_insured', 'float', 'NO', '', None, ''),
 ('amount_not_insured', 'float', 'NO', '', None, ''),
 ('bill_total', 'float', 'NO', '', None, 'VIRTUAL GENERATED'),
 ('bill_date', 'date', 'NO', '', None, ''),
 ('bill_status', "enum('PAID','UNPAID','DISPUTED')", 'NO', '', None, ''),
 ('appt_ID', 'varchar(128)', 'NO', 'MUL', None, '')]

In [30]:
%sql DESCRIBE Payment;

 * mysql+pymysql://root:***@localhost
6 rows affected.

[('receipt_ID', 'varchar(128)', 'NO', 'PRI', None, ''),
 ('paid_amount', 'float', 'NO', '', None, ''),
 ('paid_date', 'date', 'NO', '', None, ''),
 ('paid_type', "enum('CHECK','CREDITCARD','INSURANCE')", 'NO', '', None, ''),
 ('patient_ID', 'varchar(128)', 'NO', 'MUL', None, ''),
 ('bill_ID', 'varchar(128)', 'NO', 'MUL', None, '')]

In [31]:
%sql DESCRIBE Insurance_Company;

 * mysql+pymysql://root:***@localhost
1 rows affected.

[('company_ID', 'varchar(128)', 'NO', 'PRI', None, '')]

In [32]:
%sql DESCRIBE Associative_Patient_Insurance;

 * mysql+pymysql://root:***@localhost
2 rows affected.

[('patient_ID', 'varchar(128)', 'NO', 'PRI', None, ''),
 ('company_ID', 'varchar(128)', 'NO', 'MUL', None, '')]

In [33]:
%sql DESCRIBE Associative_Payment_Insurance;

 * mysql+pymysql://root:***@localhost
2 rows affected.

[('payment_ID', 'varchar(128)', 'NO', 'PRI', None, ''),
 ('company_ID', 'varchar(128)', 'NO', 'MUL', None, '')]

## S2

_Question_

- Use the classic models database that you loaded.


- Write a query that returns the following results:

```(customerNumber, customerName, no_of_orders, total_revenue)```

- where:
    - ```customerNumber``` and ```customerName``` are from ```customers```.
    - ```no_of_orders``` is the number of orders the customer has placed.
    - ```total_revenue``` is the sum of ```quantityOrdered*priceEach``` for all ```orderDetails``` in ```orders``` associated with a customer.
    

- If a customer has not placed any orders, ```no_of_orders``` and ```total_revenue``` must be ```0```.

_Answer_

In [34]:
%%sql

USE classicmodels;

SELECT customers.customerNumber,
       customers.customerName,
       COUNT(DISTINCT od.orderNumber) AS no_of_orders,
       COALESCE(SUM(odt.quantityOrdered * odt.priceEach), 0)  AS total_revenue

FROM customers
LEFT JOIN orders od on customers.customerNumber = od.customerNumber
LEFT JOIN orderdetails odt on od.orderNumber = odt.orderNumber
GROUP BY customers.customerNumber

 * mysql+pymysql://root:***@localhost
0 rows affected.
122 rows affected.

[(103, 'Atelier graphique', 3, Decimal('22314.36')),
 (112, 'Signal Gift Stores', 3, Decimal('80180.98')),
 (114, 'Australian Collectors, Co.', 5, Decimal('180585.07')),
 (119, 'La Rochelle Gifts', 4, Decimal('158573.12')),
 (121, 'Baane Mini Imports', 4, Decimal('104224.79')),
 (124, 'Mini Gifts Distributors Ltd.', 17, Decimal('591827.34')),
 (125, 'Havel & Zbyszek Co', 0, Decimal('0.00')),
 (128, 'Blauer See Auto, Co.', 4, Decimal('75937.76')),
 (129, 'Mini Wheels Co.', 3, Decimal('66710.56')),
 (131, 'Land of Toys Inc.', 4, Decimal('149085.15')),
 (141, 'Euro+ Shopping Channel', 26, Decimal('820689.54')),
 (144, 'Volvo Model Replicas, Co', 4, Decimal('66694.82')),
 (145, 'Danish Wholesale Imports', 5, Decimal('129085.12')),
 (146, 'Saveley & Henriot, Co.', 3, Decimal('130305.35')),
 (148, 'Dragon Souveniers, Ltd.', 5, Decimal('156251.03')),
 (151, 'Muscle Machine Inc', 4, Decimal('177913.95')),
 (157, 'Diecast Classics Inc.', 4, Decimal('104358.69')),
 (161, 'Technics Stores Inc.', 4, Decimal('104545.22')),
 (166, 'Handji Gifts& Co', 4, Decimal('107746.75')),
 (167, 'Herkku Gifts', 3, Decimal('97562.47')),
 (168, 'American Souvenirs Inc', 0, Decimal('0.00')),
 (169, 'Porto Imports Co.', 0, Decimal('0.00')),
 (171, 'Daedalus Designs Imports', 2, Decimal('61781.70')),
 (172, "La Corne D'abondance, Co.", 3, Decimal('86553.52')),
 (173, 'Cambridge Collectables Co.', 2, Decimal('32198.69')),
 (175, 'Gift Depot Inc.', 3, Decimal('95424.63')),
 (177, 'Osaka Souveniers Co.', 2, Decimal('62361.22')),
 (181, 'Vitachrome Inc.', 3, Decimal('72497.64')),
 (186, 'Toys of Finland, Co.', 3, Decimal('95546.46')),
 (187, 'AV Stores, Co.', 3, Decimal('148410.09')),
 (189, 'Clover Collections, Co.', 2, Decimal('49898.27')),
 (198, 'Auto-Moto Classics Inc.', 3, Decimal('21554.26')),
 (201, 'UK Collectables, Ltd.', 3, Decimal('106610.72')),
 (202, 'Canadian Gift Exchange Network', 2, Decimal('70122.19')),
 (204, 'Online Mini Collectables', 2, Decimal('55577.26')),
 (205, 'Toys4GrownUps.com', 3, Decimal('93803.30')),
 (206, 'Asian Shopping Network, Co', 0, Decimal('0.00')),
 (209, 'Mini Caravy', 3, Decimal('75859.32')),
 (211, 'King Kong Collectables, Co.', 2, Decimal('45480.79')),
 (216, 'Enaco Distributors', 3, Decimal('68520.47')),
 (219, 'Boards & Toys Co.', 2, Decimal('7918.60')),
 (223, 'Natürlich Autos', 0, Decimal('0.00')),
 (227, 'Heintze Collectables', 2, Decimal('89909.80')),
 (233, 'Québec Home Shopping Network', 3, Decimal('68977.67')),
 (237, 'ANG Resellers', 0, Decimal('0.00')),
 (239, 'Collectable Mini Designs Co.', 2, Decimal('80375.24')),
 (240, 'giftsbymail.co.uk', 2, Decimal('71783.75')),
 (242, 'Alpha Cognac', 3, Decimal('60483.36')),
 (247, 'Messner Shopping Network', 0, Decimal('0.00')),
 (249, 'Amica Models & Co.', 2, Decimal('82223.23')),
 (250, 'Lyon Souveniers', 3, Decimal('67659.19')),
 (256, 'Auto Associés & Cie.', 2, Decimal('58876.41')),
 (259, 'Toms Spezialitäten, Ltd', 2, Decimal('89223.14')),
 (260, 'Royal Canadian Collectables, Ltd.', 2, Decimal('66812.00')),
 (273, 'Franken Gifts, Co', 0, Decimal('0.00')),
 (276, "Anna's Decorations, Ltd", 4, Decimal('137034.22')),
 (278, 'Rovelli Gifts', 3, Decimal('127529.69')),
 (282, 'Souveniers And Things Co.', 4, Decimal('133907.12')),
 (286, "Marta's Replicas Co.", 2, Decimal('90545.37')),
 (293, 'BG&E Collectables', 0, Decimal('0.00')),
 (298, 'Vida Sport, Ltd', 2, Decimal('108777.92')),
 (299, 'Norway Gifts By Mail, Co.', 2, Decimal('69059.04')),
 (303, 'Schuyler Imports', 0, Decimal('0.00')),
 (307, 'Der Hund Imports', 0, Decimal('0.00')),
 (311, 'Oulu Toy Supplies, Inc.', 3, Decimal('95706.15')),
 (314, 'Petit Auto', 3, Decimal('70851.58')),
 (319, 'Mini Classics', 2, Decimal('78432.16')),
 (320, 'Mini Creations Ltd.', 3, Decimal('101872.52')),
 (321, 'Corporate Gift Ideas Co.', 4, Decimal('132340.78')),
 (323, 'Down Under Souveniers, Inc', 5, Decimal('154622.08')),
 (324, 'Stylish Desk Decors, Co.', 3, Decimal('80556.73')),
 (328, 'Tekni Collectables Inc.', 3, Decimal('81806.55')),
 (333, 'Australian Gift Network, Co', 3, Decimal('55190.16')),
 (334, 'Suominen Souveniers', 3, Decimal('103896.74')),
 (335, 'Cramer Spezialitäten, Ltd', 0, Decimal('0.00')),
 (339, 'Classic Gift Ideas, Inc', 2, Decimal('57939.34')),
 (344, 'CAF Imports', 2, Decimal('46751.14')),
 (347, "Men 'R' US Retailers, Ltd.", 2, Decimal('41506.19')),
 (348, 'Asian Treasures, Inc.', 0, Decimal('0.00')),
 (350, 'Marseille Mini Autos', 3, Decimal('71547.53')),
 (353, 'Reims Collectables', 5, Decimal('126983.19')),
 (356, 'SAR Distributors, Co', 0, Decimal('0.00')),
 (357, 'GiftsForHim.com', 3, Decimal('94431.76')),
 (361, 'Kommission Auto', 0, Decimal('0.00')),
 (362, 'Gifts4AllAges.com', 3, Decimal('84340.32')),
 (363, 'Online Diecast Creations Co.', 3, Decimal('116449.29')),
 (369, 'Lisboa Souveniers, Inc', 0, Decimal('0.00')),
 (376, 'Precious Collectables', 0, Decimal('0.00')),
 (379, 'Collectables For Less Inc.', 3, Decimal('73533.65')),
 (381, 'Royale Belge', 4, Decimal('29217.18')),
 (382, 'Salzburg Collectables', 4, Decimal('137480.07')),
 (385, 'Cruz & Sons Co.', 3, Decimal('87468.30')),
 (386, "L'ordine Souveniers", 3, Decimal('125505.57')),
 (398, 'Tokyo Collectables, Ltd', 4, Decimal('105548.73')),
 (406, 'Auto Canal+ Petit', 3, Decimal('86436.97')),
 (409, 'Stuttgart Collectable Exchange', 0, Decimal('0.00')),
 (412, 'Extreme Desk Decorations, Ltd', 3, Decimal('90332.38')),
 (415, 'Bavarian Collectables Imports, Co.', 1, Decimal('31310.09')),
 (424, 'Classic Legends Inc.', 3, Decimal('69214.33')),
 (443, 'Feuer Online Stores, Inc', 0, Decimal('0.00')),
 (447, 'Gift Ideas Corp.', 3, Decimal('49967.78')),
 (448, 'Scandinavian Gift Ideas', 3, Decimal('120943.53')),
 (450, 'The Sharp Gifts Warehouse', 4, Decimal('143536.27')),
 (452, 'Mini Auto Werke', 3, Decimal('51059.99')),
 (455, 'Super Scale Inc.', 2, Decimal('70378.65')),
 (456, 'Microscale Inc.', 2, Decimal('29230.43')),
 (458, 'Corrida Auto Replicas, Ltd', 3, Decimal('112440.09')),
 (459, 'Warburg Exchange', 0, Decimal('0.00')),
 (462, 'FunGiftIdeas.com', 3, Decimal('88627.49')),
 (465, 'Anton Designs, Ltd.', 0, Decimal('0.00')),
 (471, 'Australian Collectables, Ltd', 3, Decimal('55866.02')),
 (473, 'Frau da Collezione', 2, Decimal('25358.32')),
 (475, 'West Coast Collectables Co.', 2, Decimal('43748.72')),
 (477, 'Mit Vergnügen & Co.', 0, Decimal('0.00')),
 (480, 'Kremlin Collectables, Co.', 0, Decimal('0.00')),
 (481, 'Raanan Stores, Inc', 0, Decimal('0.00')),
 (484, 'Iberia Gift Imports, Corp.', 2, Decimal('50987.85')),
 (486, 'Motor Mint Distributors Inc.', 3, Decimal('77726.59')),
 (487, 'Signal Collectibles Ltd.', 2, Decimal('42570.37')),
 (489, 'Double Decker Gift Stores, Ltd', 2, Decimal('29586.15')),
 (495, 'Diecast Collectables', 2, Decimal('65541.74')),
 (496, "Kelly's Gift Shop", 4, Decimal('137460.79'))]

## Best Baseball Players

_Question_

- This question uses ```lahmansdb_midterm.batting```, ```lahmansdb_midterm.pitching``` and ```lahmansdb_midterm.people```. You previously loaded this information.


- There query computes performance metrics:
    - Batting:
        - On-base percentage: OBP is (sum(h) + sum(BB))/(sum(ab) + sum(BB)). This value is ```NULL``` if ```sum(ab) = 0```.
        - Slugging percentage: SLG is defined by the function below. The value is ```NULL``` if ```sum(ab) = 0```.        
```
    (
        (sum(h) - sum(`1b`) - sum(`2b`) - sum(`3b`) - sum(hr)) +
        2*sum(`2b`) + 3*sum(`3b`) + 4*hr
    )/sum(ab)
```

    - Pitching:
        - total_wins is ```sum(w)```.
        - total_loses is ```sum(l)```.
        - win_percentage is ```sum(w)/(sum(w) + sum(l))```. This value is NULL if ```sum(w) + sum(l) = 0```.

- Professor Ferguson has two criteria for someone being a great baseball player. A play must meet at least one of the criteria to be a great baseball player.
    - Batting:
        - Total number of ```ab >= 1500```.
        - SLG: Career ```SLG >= .375```
    - Pitching:
        - ```(sum(w) + sum(l)) >= 200```.
        - ```win_percentage >= 0.70)``` or ```sum(w) >= 300.```
        
        
- In your result table there is some additional guidance.
    - ```great_because``` is either ```Pitcher``` or ```Batter``` based on whether the player matched the batting or pitching criteria.
    - The values from ```batting``` are ```None``` if the player did not qualify based on batting.
    - The values from ```pitching``` are ```None``` if the player did not qualify on pitching.

__Note:__ For this query to run efficiently, you will need to create indexes on the tables.

_Answer_

- Execute your create index statements below.

In [35]:
%%sql
ALTER TABLE people
MODIFY playerID VARCHAR(128);
CREATE INDEX ppl_index ON people (playerID); 

ALTER TABLE batting
MODIFY playerID VARCHAR(128);
CREATE INDEX bat_index ON batting (playerID); 

ALTER TABLE pitching
MODIFY playerID VARCHAR(128);
CREATE INDEX pit_index ON pitching (playerID);

 * mysql+pymysql://root:***@localhost
(pymysql.err.ProgrammingError) (1146, "Table 'classicmodels.people' doesn't exist")
[SQL: ALTER TABLE people
MODIFY playerID VARCHAR(128);]
(Background on this error at: https://sqlalche.me/e/20/f405)

- Execute your SQL statement producing the query result below.

In [36]:
%sql USE lahmansdb_midterm;

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [37]:
%%sql

WITH career_basic AS (SELECT playerID,
                             (SUM(h) - SUM(hr) - SUM(`2b`) - SUM(`3b`)) AS career_singles,
                             SUM(`2b`)                                  AS career_doubles,
                             SUM(`3b`)                                  AS career_triples,
                             SUM(hr)                                    AS career_hrs,
                             SUM(ab)                                    AS career_abs,
                             SUM(h)                                     AS career_hits,
                             SUM(bb)                                    AS career_walks
                      FROM batting
                      GROUP BY playerID),

     career_averages AS (SELECT playerID,
                                career_abs,
                                career_hits,
                                career_singles,
                                career_doubles,
                                career_triples,
                                career_hrs,
                                career_walks,
                                IF(career_abs = 0, NULL,
                                   (career_hits + career_walks) / (career_abs + career_walks)) AS obp,
                                IF(career_abs = 0,
                                   NULL,
                                   (career_singles + 2 * career_doubles + 3 * career_triples + 4 * career_hrs) /
                                   career_abs
                                    )                                                          AS slg
                         FROM career_basic),

     career_win_lose AS (SELECT playerID,
                                IF(SUM(W) = 0, NULL, SUM(W))                              AS career_wins,
                                IF(SUM(L) = 0, NULL, SUM(L))                              AS career_loses,
                                IF(SUM(W) + SUM(L) = 0, NULL, SUM(W) + SUM(L))            AS career_decisions,
                                IF(SUM(W) + SUM(L) = 0, NULL, SUM(W) / (SUM(W) + SUM(L))) AS career_win_percentage
                         FROM pitching
                         GROUP BY playerID),

     great_batter AS (SELECT people.playerID,
                             nameLast,
                             nameFirst,
                             'Batter' AS great_because,
                             career_basic.career_abs,
                             career_basic.career_singles,
                             career_basic.career_doubles,
                             career_basic.career_triples,
                             NULL     AS career_wins,
                             NULL     AS career_loses,
                             NULL     AS career_decisions,
                             NULL     AS career_win_percentage
                      FROM people
                               LEFT JOIN career_basic ON people.playerID = career_basic.playerID
                               LEFT JOIN career_win_lose ON people.playerID = career_win_lose.playerID
                               LEFT JOIN career_averages ON people.playerID = career_averages.playerID
                      WHERE career_basic.career_abs >= 1500
                        AND career_averages.slg >= 0.575),

     great_pitcher AS (SELECT people.playerID,
                              nameLast,
                              nameFirst,
                              'Pitcher' AS great_because,
                              NULL      AS career_abs,
                              NULL      AS career_singles,
                              NULL      AS career_doubles,
                              NULL      AS career_triples,
                              career_win_lose.career_wins,
                              career_win_lose.career_loses,
                              career_win_lose.career_decisions,
                              career_win_lose.career_win_percentage
                       FROM people
                                LEFT JOIN career_basic ON people.playerID = career_basic.playerID
                                LEFT JOIN career_win_lose ON people.playerID = career_win_lose.playerID
                                LEFT JOIN career_averages ON people.playerID = career_averages.playerID
                       WHERE career_win_lose.career_decisions >= 200
                         AND (career_win_lose.career_win_percentage >= 0.70 OR
                              career_win_lose.career_wins >= 300))

SELECT *
FROM great_batter
UNION
SELECT *
FROM great_pitcher

 * mysql+pymysql://root:***@localhost
36 rows affected.

[('ruthba01', 'Ruth', 'Babe', 'Batter', Decimal('8398'), Decimal('1517'), Decimal('506'), Decimal('136'), None, None, None, None),
 ('hornsro01', 'Hornsby', 'Rogers', 'Batter', Decimal('8173'), Decimal('1919'), Decimal('541'), Decimal('169'), None, None, None, None),
 ('foxxji01', 'Foxx', 'Jimmie', 'Batter', Decimal('8134'), Decimal('1529'), Decimal('458'), Decimal('125'), None, None, None, None),
 ('gehrilo01', 'Gehrig', 'Lou', 'Batter', Decimal('8001'), Decimal('1531'), Decimal('534'), Decimal('163'), None, None, None, None),
 ('greenha01', 'Greenberg', 'Hank', 'Batter', Decimal('5193'), Decimal('847'), Decimal('379'), Decimal('71'), None, None, None, None),
 ('dimagjo01', 'DiMaggio', 'Joe', 'Batter', Decimal('6821'), Decimal('1333'), Decimal('389'), Decimal('131'), None, None, None, None),
 ('willite01', 'Williams', 'Ted', 'Batter', Decimal('7706'), Decimal('1537'), Decimal('525'), Decimal('71'), None, None, None, None),
 ('bondsba01', 'Bonds', 'Barry', 'Batter', Decimal('9847'), Decimal('1495'), Decimal('601'), Decimal('77'), None, None, None, None),
 ('mcgwima01', 'McGwire', 'Mark', 'Batter', Decimal('6187'), Decimal('785'), Decimal('252'), Decimal('6'), None, None, None, None),
 ('ramirma02', 'Ramirez', 'Manny', 'Batter', Decimal('8244'), Decimal('1452'), Decimal('547'), Decimal('20'), None, None, None, None),
 ('troutmi01', 'Trout', 'Mike', 'Batter', Decimal('4656'), Decimal('792'), Decimal('268'), Decimal('49'), None, None, None, None),
 ('alexape01', 'Alexander', 'Pete', 'Pitcher', None, None, None, None, Decimal('373'), Decimal('208'), Decimal('581'), Decimal('0.6420')),
 ('clarkjo01', 'Clarkson', 'John', 'Pitcher', None, None, None, None, Decimal('328'), Decimal('178'), Decimal('506'), Decimal('0.6482')),
 ('galvipu01', 'Galvin', 'Pud', 'Pitcher', None, None, None, None, Decimal('365'), Decimal('310'), Decimal('675'), Decimal('0.5407')),
 ('johnswa01', 'Johnson', 'Walter', 'Pitcher', None, None, None, None, Decimal('417'), Decimal('279'), Decimal('696'), Decimal('0.5991')),
 ('keefeti01', 'Keefe', 'Tim', 'Pitcher', None, None, None, None, Decimal('342'), Decimal('225'), Decimal('567'), Decimal('0.6032')),
 ('mathech01', 'Mathewson', 'Christy', 'Pitcher', None, None, None, None, Decimal('373'), Decimal('188'), Decimal('561'), Decimal('0.6649')),
 ('nichoki01', 'Nichols', 'Kid', 'Pitcher', None, None, None, None, Decimal('362'), Decimal('208'), Decimal('570'), Decimal('0.6351')),
 ('planked01', 'Plank', 'Eddie', 'Pitcher', None, None, None, None, Decimal('326'), Decimal('194'), Decimal('520'), Decimal('0.6269')),
 ('radboch01', 'Radbourn', 'Old Hoss', 'Pitcher', None, None, None, None, Decimal('310'), Decimal('194'), Decimal('504'), Decimal('0.6151')),
 ('spaldal01', 'Spalding', 'Al', 'Pitcher', None, None, None, None, Decimal('252'), Decimal('65'), Decimal('317'), Decimal('0.7950')),
 ('welchmi01', 'Welch', 'Mickey', 'Pitcher', None, None, None, None, Decimal('307'), Decimal('210'), Decimal('517'), Decimal('0.5938')),
 ('youngcy01', 'Young', 'Cy', 'Pitcher', None, None, None, None, Decimal('511'), Decimal('315'), Decimal('826'), Decimal('0.6186')),
 ('grovele01', 'Grove', 'Lefty', 'Pitcher', None, None, None, None, Decimal('300'), Decimal('141'), Decimal('441'), Decimal('0.6803')),
 ('spahnwa01', 'Spahn', 'Warren', 'Pitcher', None, None, None, None, Decimal('363'), Decimal('245'), Decimal('608'), Decimal('0.5970')),
 ('wynnea01', 'Wynn', 'Early', 'Pitcher', None, None, None, None, Decimal('300'), Decimal('244'), Decimal('544'), Decimal('0.5515')),
 ('carltst01', 'Carlton', 'Steve', 'Pitcher', None, None, None, None, Decimal('329'), Decimal('244'), Decimal('573'), Decimal('0.5742')),
 ('niekrph01', 'Niekro', 'Phil', 'Pitcher', None, None, None, None, Decimal('318'), Decimal('274'), Decimal('592'), Decimal('0.5372')),
 ('perryga01', 'Perry', 'Gaylord', 'Pitcher', None, None, None, None, Decimal('314'), Decimal('265'), Decimal('579'), Decimal('0.5423')),
 ('ryanno01', 'Ryan', 'Nolan', 'Pitcher', None, None, None, None, Decimal('324'), Decimal('292'), Decimal('616'), Decimal('0.5260')),
 ('seaveto01', 'Seaver', 'Tom', 'Pitcher', None, None, None, None, Decimal('311'), Decimal('205'), Decimal('516'), Decimal('0.6027')),
 ('suttodo01', 'Sutton', 'Don', 'Pitcher', None, None, None, None, Decimal('324'), Decimal('256'), Decimal('580'), Decimal('0.5586')),
 ('clemero02', 'Clemens', 'Roger', 'Pitcher', None, None, None, None, Decimal('354'), Decimal('184'), Decimal('538'), Decimal('0.6580')),
 ('glavito02', 'Glavine', 'Tom', 'Pitcher', None, None, None, None, Decimal('305'), Decimal('203'), Decimal('508'), Decimal('0.6004')),
 ('johnsra05', 'Johnson', 'Randy', 'Pitcher', None, None, None, None, Decimal('303'), Decimal('166'), Decimal('469'), Decimal('0.6461')),
 ('maddugr01', 'Maddux', 'Greg', 'Pitcher', None, None, None, None, Decimal('355'), Decimal('227'), Decimal('582'), Decimal('0.6100'))]

# Data and Schema Cleanup

## Explanation and Setup

- There are several issues with the schema for ```clasicmodels.``` Two of the issues are:
    - ```customers.country:``` Having programs or people enter country names is prone to errors.
    - ```products.productCode``` is clearly not an atomic value.
    
    
- The following SQL creates a schema with copies of the data. The SQL also loads a table of [ISO country codes.](https://en.wikipedia.org/wiki/List_of_ISO_3166_country_codes)

In [38]:
%%sql 
DROP SCHEMA IF EXISTS classicmodels_midterm;
# always drop before create
create schema classicmodels_midterm;

 * mysql+pymysql://root:***@localhost
4 rows affected.
1 rows affected.

[]

In [39]:
iso_df = pandas.read_csv('./wikipedia-iso-country-codes.csv')
iso_df.to_sql('country_codes', schema='classicmodels_midterm',
             con=sql_engine, index=False, if_exists="replace")

246

In [40]:
%%sql

use classicmodels_midterm;

alter table classicmodels_midterm.country_codes
    change `English short name lower case` short_name text null;

alter table classicmodels_midterm.country_codes
    change `Alpha-2 code` alpha_2_code text null;

alter table classicmodels_midterm.country_codes
    change `Alpha-3 code` alpha_3_code text null;

alter table classicmodels_midterm.country_codes
    change `Numeric code` numberic_code bigint null;

alter table classicmodels_midterm.country_codes
    change `ISO 3166-2` iso_text text null;

 * mysql+pymysql://root:***@localhost
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [41]:
%%sql

use classicmodels_midterm;


create table customers as select * from classicmodels.customers;


create table products as select * from classicmodels.products;

 * mysql+pymysql://root:***@localhost
0 rows affected.
122 rows affected.
110 rows affected.

[]

## DE-1

_Question_


- There are four ```country``` values in ```customers``` that are not in ```short_names``` of ```country_codes.```


- The four missing values are:

| country |
| :---: |
| USA |
| Norway |  
| UK |
| Russia |


- Write an SQL query that returns the information about by querying ```customers``` and ```country_codes```

_Answer_

In [42]:
%%sql
SELECT DISTINCT country
FROM customers
WHERE country NOT IN (SELECT short_name
                      FROM country_codes)

 * mysql+pymysql://root:***@localhost
4 rows affected.

[('USA',), ('Norway  ',), ('UK',), ('Russia',)]

## DE-2

_Question_

- Norway is on the list because there are spaces in the entry. The following query shows this fact.

In [43]:
%%sql

select customerNumber, customerName, country
from customers where length(country) != length(trim(country));

 * mysql+pymysql://root:***@localhost
2 rows affected.

[(167, 'Herkku Gifts', 'Norway  '),
 (299, 'Norway Gifts By Mail, Co.', 'Norway  ')]

- The mapping of the other country names is:

| customers.country | country_codes.short_name |
| :---: | :---: |
| USA | United States |
| UK | United Kingdom |
| Russia | Russian Federation |

- Write a __single__ ```update``` statement that corrects the values for ```customers.country```.

_Answer_

This **single** `update` statement corrects the table.

In [44]:
%%sql

UPDATE customers
SET country = CASE
    WHEN country = 'USA' THEN 'United States'
    WHEN country = 'UK' THEN 'United Kingdom'
    WHEN country = 'Russia' THEN 'Russian Federation'
    WHEN LENGTH(country) != LENGTH(TRIM(country)) THEN 'Norway'
    ELSE country
END;

 * mysql+pymysql://root:***@localhost
122 rows affected.

[]

Check if we missed something

In [45]:
%%sql

SELECT COUNT(country) AS number_of_incorrect_country_names
FROM customers
WHERE country NOT IN (SELECT short_name
                      FROM country_codes)

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(0,)]

## DE-3

_Question_

- The final tasks are:
    - Add a column ```iso_code``` to ```customers``` that is the ```alpha_2_code``` from ```country_codes```.
    - Create a foreign key relationship ```customers.iso_code -> country_codes.alpha_2_code```.
    - Drop ```country``` from ```customers```.
    - Create a view ```customers_country``` of the form ```(customerNumber, customerName, country, iso_code)```.

_Answer_

In [46]:
%%sql
# As required in the Ed https://edstem.org/us/courses/32981/discussion/2749780, we correct the Namibia to NA

UPDATE country_codes
SET alpha_2_code = 'NA' WHERE short_name = 'Namibia'

 * mysql+pymysql://root:***@localhost
1 rows affected.

[]

In [47]:
%%sql
/* Put the ALTER TABLE and CREATE VIEW statements here. */

# add the column
ALTER TABLE customers
    ADD COLUMN iso_code varchar(8);

# set values
UPDATE customers
SET iso_code =
        (SELECT alpha_2_code
         FROM country_codes
         WHERE customers.country = country_codes.short_name);

# make alpha_2_code PK
ALTER TABLE country_codes
    MODIFY COLUMN alpha_2_code varchar(8) PRIMARY KEY;

# set iso_code ---> alpha_2_code FK
ALTER TABLE customers
    ADD FOREIGN KEY (iso_code) REFERENCES country_codes (alpha_2_code);

# drop the 'country' column
ALTER TABLE customers
    DROP COLUMN country;

# create the view 'customers_country'
CREATE OR REPLACE VIEW customers_country AS
(
SElECT customerNumber, customerName, short_name AS country, iso_code
FROM customers
         LEFT JOIN country_codes ON customers.iso_code = country_codes.alpha_2_code);

 * mysql+pymysql://root:***@localhost
0 rows affected.
122 rows affected.
246 rows affected.
122 rows affected.
0 rows affected.
0 rows affected.

[]

In [48]:
%%sql
## describe the final 'customers' table
DESCRIBE customers;

 * mysql+pymysql://root:***@localhost
13 rows affected.

[('customerNumber', 'int', 'NO', '', None, ''),
 ('customerName', 'varchar(50)', 'NO', '', None, ''),
 ('contactLastName', 'varchar(50)', 'NO', '', None, ''),
 ('contactFirstName', 'varchar(50)', 'NO', '', None, ''),
 ('phone', 'varchar(50)', 'NO', '', None, ''),
 ('addressLine1', 'varchar(50)', 'NO', '', None, ''),
 ('addressLine2', 'varchar(50)', 'YES', '', None, ''),
 ('city', 'varchar(50)', 'NO', '', None, ''),
 ('state', 'varchar(50)', 'YES', '', None, ''),
 ('postalCode', 'varchar(15)', 'YES', '', None, ''),
 ('salesRepEmployeeNumber', 'int', 'YES', '', None, ''),
 ('creditLimit', 'decimal(10,2)', 'YES', '', None, ''),
 ('iso_code', 'varchar(8)', 'YES', 'MUL', None, '')]

In [49]:
%%sql
## describe the final 'country_codes' table
DESCRIBE country_codes

 * mysql+pymysql://root:***@localhost
5 rows affected.

[('short_name', 'text', 'YES', '', None, ''),
 ('alpha_2_code', 'varchar(8)', 'NO', 'PRI', None, ''),
 ('alpha_3_code', 'text', 'YES', '', None, ''),
 ('numberic_code', 'bigint', 'YES', '', None, ''),
 ('iso_text', 'text', 'YES', '', None, '')]

In [50]:
%%sql

/* Displays 25 customers_country sorted by customerName   */

SELECT *
FROM customers_country ORDER BY customerName LIMIT 25;

 * mysql+pymysql://root:***@localhost
25 rows affected.

[(242, 'Alpha Cognac', 'France', 'FR'),
 (168, 'American Souvenirs Inc', 'United States', 'US'),
 (249, 'Amica Models & Co.', 'Italy', 'IT'),
 (237, 'ANG Resellers', 'Spain', 'ES'),
 (276, "Anna's Decorations, Ltd", 'Australia', 'AU'),
 (465, 'Anton Designs, Ltd.', 'Spain', 'ES'),
 (206, 'Asian Shopping Network, Co', 'Singapore', 'SG'),
 (348, 'Asian Treasures, Inc.', 'Ireland', 'IE'),
 (103, 'Atelier graphique', 'France', 'FR'),
 (471, 'Australian Collectables, Ltd', 'Australia', 'AU'),
 (114, 'Australian Collectors, Co.', 'Australia', 'AU'),
 (333, 'Australian Gift Network, Co', 'Australia', 'AU'),
 (256, 'Auto Associés & Cie.', 'France', 'FR'),
 (406, 'Auto Canal+ Petit', 'France', 'FR'),
 (198, 'Auto-Moto Classics Inc.', 'United States', 'US'),
 (187, 'AV Stores, Co.', 'United Kingdom', 'GB'),
 (121, 'Baane Mini Imports', 'Norway', 'NO'),
 (415, 'Bavarian Collectables Imports, Co.', 'Germany', 'DE'),
 (293, 'BG&E Collectables', 'Switzerland', 'CH'),
 (128, 'Blauer See Auto, Co.', 'Germany', 'DE'),
 (219, 'Boards & Toys Co.', 'United States', 'US'),
 (344, 'CAF Imports', 'Spain', 'ES'),
 (173, 'Cambridge Collectables Co.', 'United States', 'US'),
 (202, 'Canadian Gift Exchange Network', 'Canada', 'CA'),
 (339, 'Classic Gift Ideas, Inc', 'United States', 'US')]

In [51]:
%%sql

/* Write a SELECT that displays 25 customers sorted by customerName */

SELECT *
FROM customers ORDER BY customerName LIMIT 25;

 * mysql+pymysql://root:***@localhost
25 rows affected.

[(242, 'Alpha Cognac', 'Roulet', 'Annette ', '61.77.6555', '1 rue Alsace-Lorraine', None, 'Toulouse', None, '31000', 1370, Decimal('61100.00'), 'FR'),
 (168, 'American Souvenirs Inc', 'Franco', 'Keith', '2035557845', '149 Spinnaker Dr.', 'Suite 101', 'New Haven', 'CT', '97823', 1286, Decimal('0.00'), 'US'),
 (249, 'Amica Models & Co.', 'Accorti', 'Paolo ', '011-4988555', 'Via Monte Bianco 34', None, 'Torino', None, '10100', 1401, Decimal('113000.00'), 'IT'),
 (237, 'ANG Resellers', 'Camino', 'Alejandra ', '(91) 745 6555', 'Gran Vía, 1', None, 'Madrid', None, '28001', None, Decimal('0.00'), 'ES'),
 (276, "Anna's Decorations, Ltd", "O'Hara", 'Anna', '02 9936 8555', '201 Miller Street', 'Level 15', 'North Sydney', 'NSW', '2060', 1611, Decimal('107800.00'), 'AU'),
 (465, 'Anton Designs, Ltd.', 'Anton', 'Carmen', '+34 913 728555', 'c/ Gobelas, 19-1 Urb. La Florida', None, 'Madrid', None, '28023', None, Decimal('0.00'), 'ES'),
 (206, 'Asian Shopping Network, Co', 'Walker', 'Brydey', '+612 9411 1555', 'Suntec Tower Three', '8 Temasek', 'Singapore', None, '038988', None, Decimal('0.00'), 'SG'),
 (348, 'Asian Treasures, Inc.', 'McKenna', 'Patricia ', '2967 555', '8 Johnstown Road', None, 'Cork', 'Co. Cork', None, None, Decimal('0.00'), 'IE'),
 (103, 'Atelier graphique', 'Schmitt', 'Carine ', '40.32.2555', '54, rue Royale', None, 'Nantes', None, '44000', 1370, Decimal('21000.00'), 'FR'),
 (471, 'Australian Collectables, Ltd', 'Clenahan', 'Sean', '61-9-3844-6555', '7 Allen Street', None, 'Glen Waverly', 'Victoria', '3150', 1611, Decimal('60300.00'), 'AU'),
 (114, 'Australian Collectors, Co.', 'Ferguson', 'Peter', '03 9520 4555', '636 St Kilda Road', 'Level 3', 'Melbourne', 'Victoria', '3004', 1611, Decimal('117300.00'), 'AU'),
 (333, 'Australian Gift Network, Co', 'Calaghan', 'Ben', '61-7-3844-6555', '31 Duncan St. West End', None, 'South Brisbane', 'Queensland', '4101', 1611, Decimal('51600.00'), 'AU'),
 (256, 'Auto Associés & Cie.', 'Tonini', 'Daniel ', '30.59.8555', "67, avenue de l'Europe", None, 'Versailles', None, '78000', 1370, Decimal('77900.00'), 'FR'),
 (406, 'Auto Canal+ Petit', 'Perrier', 'Dominique', '(1) 47.55.6555', '25, rue Lauriston', None, 'Paris', None, '75016', 1337, Decimal('95000.00'), 'FR'),
 (198, 'Auto-Moto Classics Inc.', 'Taylor', 'Leslie', '6175558428', '16780 Pompton St.', None, 'Brickhaven', 'MA', '58339', 1216, Decimal('23000.00'), 'US'),
 (187, 'AV Stores, Co.', 'Ashworth', 'Rachel', '(171) 555-1555', 'Fauntleroy Circus', None, 'Manchester', None, 'EC2 5NT', 1501, Decimal('136800.00'), 'GB'),
 (121, 'Baane Mini Imports', 'Bergulfsen', 'Jonas ', '07-98 9555', 'Erling Skakkes gate 78', None, 'Stavern', None, '4110', 1504, Decimal('81700.00'), 'NO'),
 (415, 'Bavarian Collectables Imports, Co.', 'Donnermeyer', 'Michael', ' +49 89 61 08 9555', 'Hansastr. 15', None, 'Munich', None, '80686', 1504, Decimal('77000.00'), 'DE'),
 (293, 'BG&E Collectables', 'Harrison', 'Ed', '+41 26 425 50 01', 'Rte des Arsenaux 41 ', None, 'Fribourg', None, '1700', None, Decimal('0.00'), 'CH'),
 (128, 'Blauer See Auto, Co.', 'Keitel', 'Roland', '+49 69 66 90 2555', 'Lyonerstr. 34', None, 'Frankfurt', None, '60528', 1504, Decimal('59700.00'), 'DE'),
 (219, 'Boards & Toys Co.', 'Young', 'Mary', '3105552373', '4097 Douglas Av.', None, 'Glendale', 'CA', '92561', 1166, Decimal('11000.00'), 'US'),
 (344, 'CAF Imports', 'Fernandez', 'Jesus', '+34 913 728 555', 'Merchants House', "27-30 Merchant's Quay", 'Madrid', None, '28023', 1702, Decimal('59600.00'), 'ES'),
 (173, 'Cambridge Collectables Co.', 'Tseng', 'Jerry', '6175555555', '4658 Baden Av.', None, 'Cambridge', 'MA', '51247', 1188, Decimal('43400.00'), 'US'),
 (202, 'Canadian Gift Exchange Network', 'Tamuri', 'Yoshi ', '(604) 555-3392', '1900 Oak St.', None, 'Vancouver', 'BC', 'V3F 2K1', 1323, Decimal('90300.00'), 'CA'),
 (339, 'Classic Gift Ideas, Inc', 'Cervantes', 'Francisca', '2155554695', '782 First Street', None, 'Philadelphia', 'PA', '71270', 1188, Decimal('81100.00'), 'US')]

## DE-4

- Just kidding.


- My first intent was to have you fix ```products```.


- Then, I thought I would make this an extra credit question.


- Finally, I decided that all students get 5 points added to there score for this exam. Since I never "curve up," you all get a bonus on final grade for putting up with the class.